Repository: ortegaps/ArduGO
Catalog: po/*.po
Languages: es

source: Install Arduino
es: Instalar Arduino

source: Run Arduino
es: Iniciar Arduino

source: What is Arduino
es: Que es Arduino

source: Help
es: Ayuda

source: Introduction on Arduino Board
es: Introducción a la placa Arduino

source: What is Arduino? Arduino is an open-source electronics platform based on easy-to-use hardware and software. Arduino boards are able to read inputs - light on a sensor, a finger on a button, or a Twitter message - and turn it into an output - activating a motor, turning on an LED, publishing something online. You can tell your board what to do by sending a set of instructions to the microcontroller on the board. To do so you use the Arduino programming language (based on Wiring), and the Arduino Software (IDE), based on Processing Over the years. Arduino has been the brain of thousands of projects, from everyday objects to complex scientific instruments. A worldwide community of makers - students, hobbyists, artists, programmers, and professionals - has gathered around this open-source platform, their contributions have added up to an incredible amount ofaccessible knowledge that can be of great help to novices and experts alike. differentiating its offer from simple 8-bit boards to products for IoT applications, wearable, 3D printing, and embedded environments. All Arduino boards are completely open-source, empowering users to build them independently and eventually adapt them to their particular needs. The software, too, is open-source, and it is growing through the contributions of users worldwide. Why Arduino? Thanks to its simple and accessible user experience, Arduino has been used in thousands of different projects and applications. The Arduino software is easy-to-use for beginners, yet flexible enough for advanced users. It runs on Mac, Windows, and Linux. Teachers and students use it to build low cost scientific instruments, to prove chemistry and physics principles, or to get started with programming and robotics. Designers and architects build interactive prototypes, musicians and artists use it for installations and to experiment with new musical instruments.Makers, of course, use it to build many of the projects exhibited at the Maker Faire, for example. Arduino is a key tool to learn new things. Anyone - children, hobbyists, artists, programmers - can start tinkering just following the step by step instructions of a kit, or sharing ideas online with other members of the Arduino community. There are many other microcontrollers and microcontroller platforms available for physical computing. Parallax Basic Stamp, Netmedia's BX-24, Phidgets, MIT's Handyboard, and many others offer similar functionality. All of these tools take the messy details of microcontroller programming and wrap it up in an easy-to-use package. Arduino also simplifies the process of working with microcontrollers, but it offers some advantage for teachers, students, and interested amateurs over other systems: Inexpensive - Arduino boards are relatively inexpensive compared to other microcontroller platforms. The least expensive version of the Arduino module can be assembled by hand, and even the pre-assembled Arduino modules cost less than $50 Cross-platform - The Arduino Software (IDE) runs on Windows, Macintosh OSX, and Linux operating systems. Most microcontroller systems are limited to Windows. Simple, clear programming environment - The Arduino Software (IDE) is easy-to-use for beginners, yet flexible enough for advanced users to take advantage of as well. For teachers, it's conveniently based on the Processing programming environment, so students learning to program in that environment will be familiar with how the Arduino IDE works. Open source and extensible software - The Arduino software is published as open source tools, available for extension by experienced programmers. The language can be expanded through C++ libraries, and people wanting to understand the technical details can make the leap from Arduino to the AVR C programming language on which it's based. Similarly, you can add AVR-C code directly into your Arduino programs if you want to.Open source and extensible hardware - The plans of the Arduino boards are published under a Creative Commons license, so experienced circuit designers can make their own version of the module, extending it and improving it. Even relatively inexperienced users can build the breadboard version of the module in order to understand how it works and save money. How do I use Arduino? See the getting started guide. If you are looking for inspiration you can find a great variety of Tutorials on Arduino Project Hub. The text of the Arduino getting started guide is licensed under a Creative Commons Attribution-ShareAlike 3.0 License. Code samples in the guide are released into the public domain. Information from https://www.arduino.cc/en/Guide/Introduction
es: " ¿Qué es Arduino? Arduino es una plataforma de electrónica de código abierto basada en hardware fácil de usarY el software. Las tarjetas Arduino son capaces de leer las entradas - la luz en un sensor, un dedo en un, O un mensaje de Twitter - y convertirlo en una salida - la activación de unMotor, encender un LED, publicar algo en línea. Usted puede decir a su junta lo que debe hacer enviando un conjunto de instrucciones a laMicrocontrolador en el tablero. Para ello se utiliza el lenguaje de programación Arduino (basado en el cableado), y elArduino Software (IDE), basado en el procesamiento a lo largo de los años. Arduino ha sido el cerebro de miles de proyectos, de objetos cotidianosA instrumentos científicos complejos. Una comunidad mundial de creadores - estudiantes, aficionados, artistas, programadores,Y los profesionales - se ha reunido alrededor de esta plataforma de código abierto, Sus contribuciones han sumado hasta una cantidad increíble ofaccessibleConocimiento que puede ser de gran ayuda para novatos y expertos por igual. Diferenciando su oferta de simples tableros de 8 bits a productos para IoTAplicaciones, portátiles, impresión en 3D y entornos incrustados Todos los ArduinoLas juntas son completamente de código abierto, lo que permite a los usuarios construirlasDe forma independiente y, finalmente, adaptarlos a sus necesidades particulares.LaSoftware, también, es de código abierto, y está creciendo a través de las contribucionesDe usuarios en todo el mundo. ¿Por qué Arduino? Gracias a su sencilla y accesible experiencia de usuario, Arduino ha sido utilizadoEn miles de proyectos y aplicaciones diferentes. El software Arduino es fácil de usar para los principiantes, pero lo suficientemente flexible como paraUsuarios avanzados. Se ejecuta en Mac, Windows y Linux.Los maestros y estudiantes lo utilizan para construirO para comenzar con la programación y la robótica. Diseñadores y arquitectos construyen prototipos interactivos, músicos y artistasLos fabricantes, por supuesto, lo utilizan para construir muchos de los proyectos expuestos en elMaker Faire, por ejemplo. Arduino es una herramienta clave para aprender cosas nuevas. Cualquier persona - niños, aficionados,Los artistas, los programadores - pueden empezar a jugar sólo siguiendo el paso a pasoInstrucciones de un kit, o compartir ideas en línea con otros miembros de laComunidad Arduino. Hay muchos otros microcontroladores y plataformas de microcontroladoresDisponible para la informática física Parallax Basic Stamp, BX-24 de Netmedia,Phidgets, Handyboard del MIT y muchos otros ofrecen funcionalidad similar. Todas estas herramientas toman los detalles desordenados de la programación de microcontroladores yEnvolverlo en un paquete fácil de usar.Arduino también simplifica el proceso deEstudiantes y aficionados interesados ​​en otros sistemas: Barato - Arduino tablas son relativamente baratos en comparación con otrosPlataformas de microcontroladores. La versión más barata del módulo Arduino se puede montar a manoE incluso los módulos Arduino pre-ensamblados cuestan menos de $ 50 Cross-platform - El software de Arduino (IDE) se ejecuta en Windows, Macintosh OSX,Y los sistemas operativos Linux.La mayoría de los sistemas de microcontroladores se limitan aWindows. Entorno de programación sencillo y claro - El software Arduino (IDE) es fácil-Para el uso para los principiantes, pero lo suficientemente flexible para los usuarios avanzados a tomarVentaja de también. Para los profesores, se basa convenientemente en la programación de ProcesamientoAmbiente, por lo que los estudiantes aprenden a programar en ese entorno seráFamiliarizado con el funcionamiento del IDE de Arduino. Software de código abierto y extensible - El software Arduino se publica comoHerramientas de código abierto, disponibles para la extensión por programadores experimentados. El lenguaje se puede expandir a través de las bibliotecas de C ++, y las personas que quieranEntender los detalles técnicos puede dar el salto de Arduino a la AVR CEl lenguaje de programación en el que se basa. De manera similar, puede agregar el código AVR-C directamente a sus programas Arduino siDesea fuente.Open y hardware extensible - Los planes de la ArduinoLas juntas se publican bajo una licencia Creative Commons, por lo queLos diseñadores de circuitos pueden hacer su propia versión del módulo, extendiéndola yMejorarlo.Incluso los usuarios relativamente inexpertos pueden construir la placa de pruebasVersión del módulo para entender cómo funciona y ahorrar dinero. ¿Cómo uso Arduino? Consulte la guía de introducción Si está buscando inspiración puedeEncuentre una gran variedad de Tutoriales en el Hub del Proyecto Arduino. El texto de la guía de inicio de Arduino se encuentra bajo una licencia CreativeLicencia de atribución de personas como ShareAlike 3.0 Los ejemplos de código en la guía sonLanzado al dominio público. Información de https://www.arduino.cc/en/Guide/Introduction"

source: Exit
es: Salir

source: Help if you can not connect your arduino board
es: Ayuda si no puedes conectar tu placa arduino

source: If you can not connect your Arduino board, these could be some problems. Problem: The serial port can not establish connection to the board. Solution: Give permissions to the desired port for example : <ACM0> entering the terminal and typing $ sudo chmod 777 /dev/ACM0 or if you do not know which port you can give permissions to all ports with $ sudo chmod 777 /dev/* You may have selected your board appropriately, but with the wrong microcontroller option. Make sure the microcontroller matches your board (either ATmega8, ATmega168, ATmega328, or ATmega1280) - the name is written on the largest chip on the board. Check if you use a noisy power supply. This could cause the chip to lose its sketch. On the other hand, the sketch may be too large for the card. When you upload your sketch, Arduino 0004 and later check if it is too large for the ATmega8, but base your calculation on a 1 Kb bootloader. You could have larger size bulbs (eg 2 Kb of the 8 Kb available on your board) . If you use official Arduino boards, this problem will not occur.
es: " Si no puede conectar su placa Arduino, estos podrían ser algunos problemas. Problema: El puerto serie no puede establecer la conexión a la placa. Solución: otorgue permisos al puerto deseado por ejemplo: <ACM0> entrando en el terminal y escribiendo $ Sudo chmod 777 / dev / ACM0 O si no sabe qué puerto puede dar permisos a todos los puertos con $ Sudo chmod 777 / dev / * Usted puede haber seleccionado su tabla apropiadamente, pero con el incorrectoAsegúrese de que el microcontrolador coincida con su placa (ATmega8, ATmega168, ATmega328 o ATmega1280) - el nombre se escribeEn el chip más grande del tablero. Compruebe si utiliza una fuente de alimentación ruidosa Esto podría hacer que el chip pierda suBoceto. Por otro lado, el boceto puede ser demasiado grande para la tarjeta Cuando se cargaSu boceto, Arduino 0004 y más tarde comprobar si es demasiado grande para elATmega8, Pero base su cálculo en un gestor de arranque de 1 Kb. Podría tener un tamaño más grande(Por ejemplo, 2 Kb de los 8 Kb disponibles en su placa) Si utilizaTablas de Arduino, Este problema no se producirá. "

source: Steps to install Arduino IDE an pyserial on your XO
es: Pasos para instalar Arduino IDE y Pyserial en tu XO

source: To install the Arduino IDE you must enter the Terminal Activity and type these commands: First step: To locate in the directory where the package to install is located for that type $cd /home/olpc/Activities/ArduGO.activity/ or some other location depending on how they are ripping Sugar. Second Step: Install the Arduino package on your system, for that you write in the terminal: $sudo yum install -y arduino-1.0.5-6.fc20.noarch Third Step: Install the Pyserial package on your system, for that you write in the terminal: $sudo yum install -y pyserial-2.7-1.fc20.noarch Then you can start IDE Arduino from the main menu :)
es: "Para instalar el IDE de Arduino debe ingresar la Actividad de Terminal y escribirEstos comandos: Primer paso: Para localizar en el directorio donde el paquete a instalar esUbicado para ese tipo $ Cd /home/olpc/Activities/ArduGO.activity/ O alguna otra ubicación dependiendo de cómo se estén rasgando Sugar. Segundo paso: Instale el paquete Arduino en su sistema, para eso escribaEn el terminal: $ Sudo yum install -y arduino-1.0.5-6.fc20.noarch Tercer paso: Instale el paquete de Pyserial en su sistema, para eso escribaEn el terminal: $ Sudo yum install -y pyserial-2.7-1.fc20.noarch Entonces puedes iniciar IDE Arduino desde el menú principal :)"
